9/data/attachments/22e6551040c60290.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_058eefb2-d7a6-4289-8e9d-d1b68a887385</nif:username>
            <nif:friendToBeAdded>Joshua_institution_Friend_70842_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>